# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'composer'
brew 'orbstack'
brew 'ddev/ddev/ddev'
brew 'mkcert'
brew 'nss'
brew 'gh'
brew 'git'
brew 'grep'
brew 'go'
brew 'has'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'php'
brew 'trash'
brew 'nvm'
brew 'pantheon-systems/external/terminus'

# Apps
cask 'arc'
cask 'appcleaner'
cask 'discord'
cask 'firefox'
cask 'google-chrome'
cask 'monitorcontrol'
cask 'logi-options-plus'
cask 'notion'
cask 'notion-calendar'
cask 'phpstorm'
cask 'raycast'
cask 'slack'
cask 'sublime-text'
cask 'surfshark'
cask 'visual-studio-code'
cask 'cursor'
cask 'orion'
cask 'vlc'
cask 'warp'
cask 'zoom'
cask 'sequel-ace'
cask 'postman'
cask 'whatsapp'

# Fonts
cask 'font-source-code-pro-for-powerline'
